madubois/nrf9160-feather-examples-and-drivers/samples/cerbere_gps/src/main.c
	int ret;

	LOG_INF("Connected...");


/////////////////////////////////////////////////////////////////////////////////////


struct sockaddr_in local_addr;
    struct addrinfo *res;
    int send_data_len;
    int num_bytes;
    int mtu_size = MAX_MTU_SIZE;
    //char send_buf[SEND_BUF_SIZE];
   
    local_addr.sin_family = AF_INET;
    local_addr.sin_port = htons(0);
    local_addr.sin_addr.s_addr = 0;


	struct addrinfo hints = {
		.ai_family = AF_INET,       //1
		.ai_socktype = SOCK_DGRAM,  //2
        .ai_next = NULL,
        .ai_addr = NULL,
        .ai_protocol = 0   //any protocol
	};

    int err = getaddrinfo(HTTP_HOST, NULL, &hints, &res);
    LOG_INF("getaddrinfo err: %d\n\r", err);
	
    ((struct sockaddr_in *)res->ai_addr)->sin_port = htons(HTTP_PORT);
   
	

    int client_fd = socket(AF_INET, SOCK_STREAM, 0);

    LOG_INF("client_fd: %d\n\r", client_fd);
    err = bind(client_fd, (struct sockaddr *)&local_addr,sizeof(local_addr));
    LOG_INF("bind err: %d\n\r", err);
    err = blocking_connect(client_fd, (struct sockaddr *)res->ai_addr,sizeof(struct sockaddr_in));
    LOG_INF("connect err: %d\n\r", err);

	

    LOG_INF("\n\rPrepare send buffer:\n\r");

    int ts=300;
    //float lat=12.2;
    //float lng=-12.5;

	/*
	LOG_INF(						 "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n"
                                     "Connection: keep-alive\r\n"
                                     "Content-Type: application/json\r\n"
                                     "Content-length: %d\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, strlen(JSON_TEMPLATE) + 3, angle_x, angle_y, angle_z);

	int x = 123;
	send_data_len = snprintf(send_buf,sizeof send_buf, "%dx", x);
	*/
	

	/*
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n"
                                     "Content-length: %d\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, strlen(JSON_TEMPLATE) + 3, ts, lat, lng);
	
	*/
    send_data_len = snprintf(send_buf, 2000,
                                     "POST %s HTTP/1.1\r\n"
                                     "Host: %s\r\n\r\n"
                                     JSON_TEMPLATE,
                                     HTTP_PATH, HTTP_HOST, ts, lat, lng);
	
   
    do {
        num_bytes =
        blocking_send(client_fd, send_buf, send_data_len, 0);
       
        if (num_bytes < 0) {
            LOG_INF("ret: %d, errno: %s\n", num_bytes, strerror(errno));
        };

    } while (num_bytes < 0);

    LOG_INF("\n\rFinished. Closing socket\n");
    err = close(client_fd);

    freeaddrinfo(res);
















///////////////////////////////////////////////////////////////////////////////////////

    ret = lte_lc_func_mode_set(LTE_LC_FUNC_MODE_DEACTIVATE_LTE);


    if (ret) {
        LOG_ERR("Failed to disconnect from LTE network");
    } else {
        LOG_INF("Disconnected from LTE network");
    }





                k_sem_give(&lte_connected);
                break;

        case LTE_LC_EVT_RRC_UPDATE:
        case LTE_LC_EVT_CELL_UPDATE:
        case LTE_LC_EVT_LTE_MODE_UPDATE:
        case LTE_LC_EVT_MODEM_EVENT:
                /* Handle LTE events that are enabled by default. */
                break;

        default:
                break;
        }
}






static void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	printf("Latitude:       %.06f\n", pvt_data->latitude);
	printf("Longitude:      %.06f\n", pvt_data->longitude);
	printf("Altitude:       %.01f m\n", pvt_data->altitude);
	printf("Accuracy:       %.01f m\n", pvt_data->accuracy);
	printf("Speed:          %.01f m/s\n", pvt_data->speed);
	printf("Speed accuracy: %.01f m/s\n", pvt_data->speed_accuracy);
	printf("Heading:        %.01f deg\n", pvt_data->heading);
	printf("Date:           %04u-%02u-%02u\n",
	       pvt_data->datetime.year,
	       pvt_data->datetime.month,
	       pvt_data->datetime.day);
	printf("Time (UTC):     %02u:%02u:%02u.%03u\n",
	       pvt_data->datetime.hour,
	       pvt_data->datetime.minute,
	       pvt_data->datetime.seconds,
	       pvt_data->datetime.ms);
	printf("PDOP:           %.01f\n", pvt_data->pdop);
	printf("HDOP:           %.01f\n", pvt_data->hdop);
	printf("VDOP:           %.01f\n", pvt_data->vdop);
	printf("TDOP:           %.01f\n", pvt_data->tdop);

	lat = pvt_data->latitude;
	lng = pvt_data->longitude;

    int ret;

        ret = lte_lc_connect_async(lte_handler);
        if (ret) {
                printk("lte_lc_connect_async, error: %d\n", ret);
                return 0;
        }

        k_sem_take(&lte_connected, K_FOREVER);
	



	LOG_INF("Sleeping for 30 s to avoid the provider to be pissed...");

	k_sleep(K_SECONDS(30));

	LOG_INF("done");

}

int main(void)
{
	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	LOG_INF("Starting GNSS sample");

	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		return err;
	}

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		return -1;
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		return -1;
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		return -1;
	}

	fix_timestamp = k_uptime_get();

	lte_lc_init();


	/*
    int ret;

        ret = lte_lc_connect_async(lte_handler);
        if (ret) {
                printk("lte_lc_connect_async, error: %d\n", ret);
                return 0;
        }

